; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_2 object type_1 type_3)
 (:predicates (pred_4 ?v4 - type_1 ?v7 - type_2)
 	      (pred_3 ?v1 - object ?v7 - type_2)
	      (pred_1 ?v4 - type_1 ?v2 - type_3)
	      (pred_2 ?v4 - type_1 ?v1 - object ?v2 - type_3))

   (:action op_3
       :parameters  (?v4 - type_1 ?v6 ?v5 - type_2)
       :precondition (and  (pred_4 ?v4 ?v6))
       :effect (and  (pred_4 ?v4 ?v5)
		     (not (pred_4 ?v4 ?v6))))

   (:action op_2
       :parameters (?v4 - type_1 ?v3 - object ?v8 - type_2 ?v2 - type_3)
       :precondition  (and  (pred_3 ?v3 ?v8) (pred_4 ?v4 ?v8) (pred_1 ?v4 ?v2))
       :effect (and (pred_2 ?v4 ?v3 ?v2)
		    (not (pred_3 ?v3 ?v8)) 
		    (not (pred_1 ?v4 ?v2))))

   (:action op_1
       :parameters (?v4 - type_1 ?v3 - object ?v8 - type_2 ?v2 - type_3)
       :precondition  (and  (pred_2 ?v4 ?v3 ?v2) (pred_4 ?v4 ?v8))
       :effect (and (pred_3 ?v3 ?v8)
		    (pred_1 ?v4 ?v2)
		    (not (pred_2 ?v4 ?v3 ?v2)))))

; problem
(define (problem gripper-2-4-3)
(:domain gripper-strips)
(:objects obj_01 obj_04 - type_1
obj_11 obj_06 obj_13 obj_05 - type_3
obj_03 obj_12 obj_09 obj_07 - type_2
obj_02 obj_08 obj_10 - object)
(:init
(pred_4 obj_01 obj_07)
(pred_1 obj_01 obj_11)
(pred_1 obj_01 obj_06)
(pred_4 obj_04 obj_09)
(pred_1 obj_04 obj_13)
(pred_1 obj_04 obj_05)
(pred_3 obj_02 obj_03)
(pred_3 obj_08 obj_12)
(pred_3 obj_10 obj_12)
)
(:goal
(and
(pred_3 obj_02 obj_09)
(pred_3 obj_08 obj_09)
(pred_3 obj_10 obj_07)
)
)

(:constraints
  (always (not (pred_4 obj_01 obj_09)))
)
)

; plan
1. (op_3 obj_01 obj_07 obj_03)
   deleted: (pred_4 obj_01 obj_07)
   added: (pred_4 obj_01 obj_03)
   goals met: 0 of 3
2. (op_3 obj_04 obj_09 obj_12)
   deleted: (pred_4 obj_04 obj_09)
   added: (pred_4 obj_04 obj_12)
   goals met: 0 of 3
3. (op_2 obj_01 obj_02 obj_03 obj_06)
   deleted: (pred_3 obj_02 obj_03) (pred_1 obj_01 obj_06)
   added: (pred_2 obj_01 obj_02 obj_06)
   goals met: 0 of 3
4. (op_2 obj_04 obj_10 obj_12 obj_05)
   deleted: (pred_3 obj_10 obj_12) (pred_1 obj_04 obj_05)
   added: (pred_2 obj_04 obj_10 obj_05)
   goals met: 0 of 3
5. (op_2 obj_04 obj_08 obj_12 obj_13)
   deleted: (pred_3 obj_08 obj_12) (pred_1 obj_04 obj_13)
   added: (pred_2 obj_04 obj_08 obj_13)
   goals met: 0 of 3
6. (op_3 obj_04 obj_12 obj_07)
   deleted: (pred_4 obj_04 obj_12)
   added: (pred_4 obj_04 obj_07)
   goals met: 0 of 3
7. (op_1 obj_01 obj_02 obj_03 obj_06)
   deleted: (pred_2 obj_01 obj_02 obj_06)
   added: (pred_3 obj_02 obj_03) (pred_1 obj_01 obj_06)
   goals met: 0 of 3
8. (op_1 obj_04 obj_10 obj_07 obj_05)
   deleted: (pred_2 obj_04 obj_10 obj_05)
   added: (pred_3 obj_10 obj_07) (pred_1 obj_04 obj_05)
   goals met: 1 of 3
9. (op_3 obj_04 obj_07 obj_09)
   deleted: (pred_4 obj_04 obj_07)
   added: (pred_4 obj_04 obj_09)
   goals met: 1 of 3
10. (op_1 obj_04 obj_08 obj_09 obj_13)
   deleted: (pred_2 obj_04 obj_08 obj_13)
   added: (pred_3 obj_08 obj_09) (pred_1 obj_04 obj_13)
   goals met: 2 of 3
11. (op_3 obj_04 obj_09 obj_03)
   deleted: (pred_4 obj_04 obj_09)
   added: (pred_4 obj_04 obj_03)
   goals met: 2 of 3
12. (op_2 obj_04 obj_02 obj_03 obj_05)
   deleted: (pred_3 obj_02 obj_03) (pred_1 obj_04 obj_05)
   added: (pred_2 obj_04 obj_02 obj_05)
   goals met: 2 of 3
13. (op_3 obj_04 obj_03 obj_09)
   deleted: (pred_4 obj_04 obj_03)
   added: (pred_4 obj_04 obj_09)
   goals met: 2 of 3
14. (op_1 obj_04 obj_02 obj_09 obj_05)
   deleted: (pred_2 obj_04 obj_02 obj_05)
   added: (pred_3 obj_02 obj_09) (pred_1 obj_04 obj_05)
   goals met: 3 of 3
